examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider2_Base.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39604536[ label="{Recipe|}"]

39958040[ label="{Ingredient|+count:POS_FLOAT\l}"]

39593592[ label="{IngredientType|+name:ID\l}"]

39598536[ label="{Unit|+weight:POS_FLOAT\l+name:ID\l}"]

39991032[ label="{POS_FLOAT|\\d+ . UINT\?}"]

39822424[ label="{UINT|\\d+}"]

39613784[ label="{ID|}"]

39607480[ label="{STRING|}"]

39932904[ label="{BOOL|}"]

39320696[ label="{INT|}"]

39610840[ label="{FLOAT|}"]

40053448[ label="{STRICTFLOAT|}"]

40097000[ label="{NUMBER|}"]

40108536[ label="{BASETYPE|}"]

40130520[ label="{*OBJECT|}"]



39604536 -> 39958040[arrowtail=diamond, dir=both, headlabel="ingredients 1..*"]
39958040 -> 39598536[headlabel="unit "]
39958040 -> 39593592[headlabel="type "]
39593592 -> 39593592[headlabel="extends "]
39593592 -> 39598536[arrowtail=diamond, dir=both, headlabel="units 1..*"]
40097000 -> 40053448 [dir=back]
40097000 -> 39320696 [dir=back]
40108536 -> 40097000 [dir=back]
40108536 -> 39610840 [dir=back]
40108536 -> 39932904 [dir=back]
40108536 -> 39613784 [dir=back]
40108536 -> 39607480 [dir=back]
40130520 -> 40108536 [dir=back]

}
